# Lab Session

## <font color='blue'> Table Of Contents </font>
- Problem Statement
- Load required libraries
- Connect to DB using mysql-connector-python package
- Create database named `e_commerce`
- Create tables and insert data into tables as specified in the question
- Read all the questions and write sql queries to meet the objective

## <font color='blue'> Problem Statement </font>
###  An E-commerce website manages its data in the form of various tables.
You need to create a Database called `e_commerce` and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

<img src="e_commerce_schema-1.PNG">

### Install MySQL-Connector-Python

In [252]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\administrator\anaconda3\lib\site-packages (9.0.0)

### Install MySQL-Connector

In [254]:
!pip install mysql-connector

Requirement already satisfied: mysql-connector in c:\users\administrator\anaconda3\lib\site-packages (2.2.9)

### Load Required Libraries

In [256]:
import mysql.connector as con
import pandas as pd

### Connect to DB using MySQL-connector-python package

In [258]:

# RUN the following ALTER Query in MySQL workbench to link 'mysql_native_password' keyword by '<passwd>' for <user>@<host>
# ALTER USER 'root'@'localhost' IDENTIFIED WITH mysql_native_password BY 'MySQLadmin_5555';

# connection to MySQL server and print the connection object
connection = con.connect(host='localhost',
                      user='root',
                      passwd='MySQLadmin_5555',
                      auth_plugin = 'mysql_native_password')

print(connection)

<mysql.connector.connection.MySQLConnection object at 0x0000019663C6AD50>

##### Create cursor to perform Database operations

In [260]:
# Open a cursor to perform database operations
cursor = connection.cursor()
print(cursor)

MySQLCursor: (Nothing executed yet)

### You are required to create a database named 'e_commerce'

In [262]:
# drop database named 'e_commerce' if exist
cursor.execute("DROP DATABASE IF EXISTS e_commerce")

# create a database named 'e_commerce' 
cursor.execute("CREATE DATABASE e_commerce")
cursor.execute("USE e_commerce")

### Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


- **`supplier`**(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))


- **`customer`** (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))


- **`category`** (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))


- **`product`** (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))


- **`product_details`** (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
  PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
  
  
- **`order`** (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))


- **`rating`** (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))

In [264]:
# Creating required tables  
cursor.execute("CREATE TABLE e_commerce.supplier(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))")
cursor.execute("CREATE TABLE e_commerce.customer(CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))")
cursor.execute("CREATE TABLE e_commerce.category(CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))")
cursor.execute("CREATE TABLE e_commerce.product(PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))")
cursor.execute("CREATE TABLE e_commerce.product_details(PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL, PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))")
cursor.execute("CREATE TABLE e_commerce.order(ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))")
cursor.execute("CREATE TABLE e_commerce.rating(RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))")

### Q2. Insert the following data in the table created above
#### `Note:` If you are getting any error while inserting the data into tables, Kindly close the connection and reconnect

#### Table:  supplier
| SUPP_ID | SUPP_NAME | SUPP_CITY | SUPP_PHONE |
| --- | --- | --- | --- |
| 1 | Rajesh Retails | Delhi | 1234567890 |
| 2 | Appario Ltd. | Mumbai | 2589631470 |
| 3 | Knome products | Bangalore | 9785462315 |
| 4 | Bansal Retails | Kochi | 8975463285 |
| 5 | Mittal Ltd. | Lucknow | 7898456532 |

In [266]:
# insert into "supplier" table
sqlQuery = "INSERT INTO e_commerce.supplier(SUPP_ID,SUPP_NAME,SUPP_CITY,SUPP_PHONE) VALUES(%s,%s,%s,%s)"
values = [(1,'Rajesh Retails','Delhi','1234567890'),
          (2,'Appario Ltd.','Mumbai','2589631470'),
          (3,'Knome products','Bangalore','9785462315'),
          (4,'Bansal Retails','Kochi','8975463285'),
          (5,'Mittal Ltd.','Lucknow','7898456532')]

cursor.executemany(sqlQuery,values);
connection.commit();

#### Table:  customer
| CUS_ID | CUS_NAME | CUS_PHONE | CUS_CITY | CUS_GENDER
| --- | --- | --- | --- | --- |
| 1 | AAKASH | 9999999999 | DELHI | M |
| 2 | AMAN | 9785463215 | NOIDA | M |
| 3 | NEHA | 9999999998 | MUMBAI | F |
| 4 | MEGHA | 9994562399 | KOLKATA | F |
| 5 | PULKIT | 7895999999 | LUCKNOW | M |

In [268]:
# insert into "customer" table

sqlQuery = "INSERT INTO e_commerce.customer(CUS_ID,CUS_NAME,CUS_PHONE,CUS_CITY,CUS_GENDER) VALUES(%s,%s,%s,%s,%s)"
values = [(1,'AAKASH','9999999999','DELHI','M'),
          (2,'AMAN','9785463215','NOIDA','M'),
          (3,'NEHA','9999999998','MUMBAI','F'),
          (4,'MEGHA','9994562399','KOLKATA','F'),
          (5,'PULKIT','7895999999','LUCKNOW','M')]

cursor.executemany(sqlQuery,values)
connection.commit()

#### Table:  category
| CAT_ID | CAT_NAME |
| --- | --- |  
| 1 | BOOKS |
| 2 | GAMES |  
| 3 | GROCERIES |
| 4 | ELECTRONICS |
| 5 | CLOTHES |

In [270]:
# insert into "categoty" table
sqlQuery = "INSERT INTO e_commerce.category(CAT_ID,CAT_NAME) VALUES(%s,%s)"
values = [(1,'BOOKS'),
          (2,'GAMES'),
          (3,'GROCERIES'),
          (4,'ELECTRONICS'),
          (5,'CLOTHES')]

cursor.executemany(sqlQuery,values)
connection.commit()

#### Table:  product
| PRO_ID | PRO_NAME | PRO_DESC | CAT_ID |
| --- | --- | --- | --- |
| 1 | GTA V | DFJDJFDJFDJFDJFJF | 2 |
| 2 | TSHIRT | DFDFJDFJDKFD | 5 |
| 3 | ROG LAPTOP | DFNTTNTNTERND | 4 |
| 4 | OATS | REURENTBTOTH | 3 |
| 5 | HARRY POTTER | NBEMCTHTJTH | 1 |

In [272]:
# insert into "product" table
sqlQuery = "INSERT INTO e_commerce.product(PRO_ID,PRO_NAME,PRO_DESC,CAT_ID) VALUES(%s,%s,%s,%s)"
values = [(1,'GTA V','DFJDJFDJFDJFDJFJF',2),
          (2,'TSHIRT','DFDFJDFJDKFD',5),
          (3,'ROG LAPTOP','DFNTTNTNTERND',4),
          (4,'OATS','REURENTBTOTH',3),
          (5,'HARRY POTTER','NBEMCTHTJTH',1)]

cursor.executemany(sqlQuery,values)
connection.commit()

#### Table:  product_details
| PROD_ID | PRO_ID | SUPP_ID | PROD_PRICE |
| --- | --- | --- | --- |
| 1 | 1 | 2 | 1500 |
| 2 | 3 | 5 | 30000 |
| 3 | 5 | 1 | 3000 |
| 4 | 2 | 3 | 2500 |
| 5 | 4 | 1 | 1000 |

In [274]:
# insert into "product_details" table
sqlQuery = "INSERT INTO e_commerce.product_details(PROD_ID,PRO_ID,SUPP_ID,PROD_PRICE) VALUES(%s,%s,%s,%s)"
values = [(1,1,2,1500),
          (2,3,5,30000),
          (3,5,1,3000),
          (4,2,3,2500),
          (5,4,1,1000)]

cursor.executemany(sqlQuery,values)
connection.commit()

#### Table:  orders
| ORD_ID | ORD_AMOUNT | ORD_DATE | CUS_ID | PROD_ID
| --- | --- | --- | --- | --- |
| 20 | 1500 | 2021-10-12 | 3 | 5 |
| 25 | 30500 | 2021-09-16 | 5 | 2 |
| 26 | 2000 | 2021-10-05 | 1 | 1 |
| 30 | 3500 | 2021-08-16 | 4 | 3 |
| 50 | 2000 | 2021-10-06 | 2 | 1 |

In [276]:
# insert into "orders" table
sqlQuery = "INSERT INTO e_commerce.order(ORD_ID,ORD_AMOUNT,ORD_DATE,CUS_ID,PROD_ID) VALUES(%s,%s,%s,%s,%s)"
values = [(20,1500,'2021-10-12',3,5),
          (25,30500,'2021-09-16',5,2),
          (26,2000,'2021-10-05',1,1),
          (30,3500,'2021-08-16',4,3),
          (50,2000,'2021-10-06',2,1)]

cursor.executemany(sqlQuery,values)
connection.commit()

#### Table: rating
| RAT_ID | CUS_ID | SUPP_ID | RAT_RATSTARS |
| --- | --- | --- | --- |
| 1 | 2 | 2 | 4 |
| 2 | 3 | 4 | 3 |
| 3 | 5 | 1 | 5 |
| 4 | 1 | 3 | 2 |
| 5 | 4 | 5 | 4 |

In [278]:
# insert into "rating" table
sqlQuery = "INSERT INTO e_commerce.rating(RAT_ID,CUS_ID,SUPP_ID,RAT_RATSTARS) VALUES(%s,%s,%s,%s)"
values = [(1,2,2,4),
          (2,3,4,3),
          (3,5,1,5),
          (4,1,3,2),
          (5,4,5,4)]

cursor.executemany(sqlQuery,values)
connection.commit()

### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [280]:

sqlQuery = """ SELECT CUS_GENDER AS GENDER, count(CUS.CUS_ID) AS COUNT  
              FROM e_commerce.CUSTOMER AS CUS
              JOIN e_commerce.ORDER AS ORD ON ORD.CUS_ID = CUS.CUS_ID
              WHERE ORD.ORD_AMOUNT >= 3000 GROUP BY CUS.CUS_GENDER; """

cursor.execute(sqlQuery)
records = cursor.fetchall()

df = pd.DataFrame(records,columns=['GENDER','COUNT'])
df

  GENDER  COUNT
0      M      1
1      F      1

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [282]:
sqlQuery = """ SELECT ORD.*, PRO.PRO_NAME AS PRODUCTS 
               FROM e_commerce.ORDER AS ORD 
               JOIN e_commerce.PRODUCT AS PRO ON PRO.PRO_ID = ORD.PROD_ID
               JOIN e_commerce.CUSTOMER AS CUS ON CUS.CUS_ID = ORD.CUS_ID
               WHERE CUS.CUS_ID = 2 ORDER BY CUS.CUS_NAME
               """
cursor.execute(sqlQuery)
records = cursor.fetchall()

df = pd.DataFrame(records,columns=['ORD_ID','ORD_AMOUNT','ORD_DATE','CUS_ID','PROD_ID','PRODUCTS'])
df

   ORD_ID  ORD_AMOUNT    ORD_DATE  CUS_ID  PROD_ID PRODUCTS
0      50        2000  2021-10-06       2        1    GTA V

### Q5) Display the Supplier details who can supply more than one product.

In [284]:
sqlQuery = """ SELECT SUPP.*
               FROM e_commerce.SUPPLIER AS SUPP ,
                    e_commerce.PRODUCT_DETAILS AS PROD_DTLS
               WHERE SUPP.SUPP_ID IN (SELECT PROD_DTLS.SUPP_ID 
                                      FROM e_commerce.PRODUCT_DETAILS AS PROD_DTLS
                                      GROUP BY PROD_DTLS.SUPP_ID HAVING count(PROD_DTLS.SUPP_ID) > 1)
                                      GROUP BY SUPP.SUPP_ID;"""
cursor.execute(sqlQuery)
records = cursor.fetchall()

df = pd.DataFrame(records,columns=['SUPP_ID','SUPP_NAME','SUPP_CITY','SUPP_PHONE'])
df

   SUPP_ID       SUPP_NAME SUPP_CITY  SUPP_PHONE
0        1  Rajesh Retails     Delhi  1234567890

### Q6) Find the category of the product whose order amount is minimum.

In [286]:
sqlQuery = """ SELECT CAT.CAT_ID, CAT.CAT_NAME, MIN(ORD.ORD_AMOUNT) AS MIN_ORDER_AMOUNT
               FROM e_commerce.ORDER AS ORD
               JOIN e_commerce.PRODUCT_DETAILS AS PROD_DTLS ON PROD_DTLS.PROD_ID = ORD.PROD_ID
               JOIN e_commerce.PRODUCT AS PRO ON PRO.PRO_ID = PROD_DTLS.PRO_ID
               JOIN e_commerce.CATEGORY AS CAT ON CAT.CAT_ID = PRO.CAT_ID 
               GROUP BY CAT.CAT_ID, CAT.CAT_NAME;"""

cursor.execute(sqlQuery)
records = cursor.fetchall()

df = pd.DataFrame(records,columns=['CAT_ID','CAT_NAME','MIN_ORDER_AMOUNT'])
df

   CAT_ID     CAT_NAME  MIN_ORDER_AMOUNT
0       3    GROCERIES              1500
1       4  ELECTRONICS             30500
2       2        GAMES              2000
3       1        BOOKS              3500

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [288]:
sqlQuery = """ SELECT PRO.PRO_ID, PRO.PRO_NAME
               FROM e_commerce.ORDER AS ORD
               JOIN e_commerce.PRODUCT_DETAILS AS PROD_DTLS ON PROD_DTLS.PROD_ID = ORD.PROD_ID
               JOIN e_commerce.PRODUCT AS PRO ON PRO.PRO_ID = PROD_DTLS.PRO_ID
               WHERE ORD.ORD_DATE > "2021-10-05";"""

cursor.execute(sqlQuery)
records = cursor.fetchall()

df = pd.DataFrame(records,columns=['PRO_ID','PRO_NAME'])
df

   PRO_ID PRO_NAME
0       4     OATS
1       1    GTA V

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [290]:
sqlQuery = """ SELECT SUPP.SUPP_ID, SUPP.SUPP_NAME, CUS.CUS_NAME, RATING.RAT_RATSTARS  
            FROM e_commerce.RATING 
            JOIN e_commerce.SUPPLIER AS SUPP ON RATING.SUPP_ID = SUPP.SUPP_ID
            JOIN E_commerce.CUSTOMER AS CUS  ON RATING.CUS_ID = CUS.CUS_ID 
            ORDER BY RATING.RAT_RATSTARS DESC LIMIT 3;"""

cursor.execute(sqlQuery)
records = cursor.fetchall()

df = pd.DataFrame(records,columns=['SUPP_ID','SUPP_NAME','CUS_NAME', 'RAT_RATSTARS'])
df

   SUPP_ID       SUPP_NAME CUS_NAME  RAT_RATSTARS
0        1  Rajesh Retails   PULKIT             5
1        2    Appario Ltd.     AMAN             4
2        5     Mittal Ltd.    MEGHA             4

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [292]:
sqlQuery = """ SELECT  CUS.CUS_NAME, CUS.CUS_GENDER
               FROM e_commerce.CUSTOMER AS CUS
               WHERE CUS.CUS_NAME LIKE "A%" 
               OR CUS.CUS_NAME LIKE "%A"; """

cursor.execute(sqlQuery)
records = cursor.fetchall()

df = pd.DataFrame(records,columns=['CUS_NAME','CUS_GENDER'])
df

  CUS_NAME CUS_GENDER
0   AAKASH          M
1     AMAN          M
2     NEHA          F
3    MEGHA          F

### Q10) Display the total order amount of the male customers.

In [294]:
sqlQuery = """ SELECT SUM(ORD.ORD_AMOUNT) AS AMOUNT
               FROM e_commerce.ORDER AS ORD
               JOIN e_commerce.CUSTOMER AS CUS ON CUS.CUS_ID = ORD.CUS_ID
            WHERE CUS.CUS_GENDER = "M"; """

cursor.execute(sqlQuery)
records = cursor.fetchall()

df = pd.DataFrame(records,columns=['AMOUNT'])
df

  AMOUNT
0  34500

### Q11) Display all the Customers left outer join with  the orders

In [296]:
sqlQuery = """ SELECT * FROM e_commerce.CUSTOMER AS CUS 
               LEFT OUTER JOIN e_commerce.ORDER AS ORD ON ORD.ORD_ID = CUS.CUS_ID; """

cursor.execute(sqlQuery)
records = cursor.fetchall()

df = pd.DataFrame(records,columns=['CUS_ID','CUS_NAME','CUS_PHONE','CUS_CITY','CUS_GENDER','ORD_ID','ORD_AMOUNT','ORD_DATE','CUS_ID','PROD_ID'])
df

,CUS_ID,CUS_NAME,CUS_PHONE,CUS_CITY,CUS_GENDER,ORD_ID,ORD_AMOUNT,ORD_DATE,CUS_ID,PROD_ID
0,1,AAKASH,9999999999,DELHI,M,None,None,None,None,None
1,2,AMAN,9785463215,NOIDA,M,None,None,None,None,None
2,3,NEHA,9999999998,MUMBAI,F,None,None,None,None,None
3,4,MEGHA,9994562399,KOLKATA,F,None,None,None,None,None
4,5,PULKIT,7895999999,LUCKNOW,M,None,None,None,None,None

####

### Closing the database connection

In [299]:
# Closing the connection after database operation
connection.close()

**NOTE:** Always close an open connection once you are done with the database operations

## Happy Learning:)